#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СозданиеНовогоЖанра(Наименование) Экспорт

	НовыйЖанр = Справочники.Жанры.СоздатьЭлемент();
	НовыйЖанр.Наименование = Наименование;
	НовыйЖанр.Записать();
	Возврат НовыйЖанр.Ссылка;

КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти