// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Склад") Тогда 
		Склад = Параметры.Склад;
	КонецЕсли;
	ОбновитьСписокДоступныхКниг();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура Добавить(Команда)
	Выбор = Новый Массив;
	
	Для каждого ТекущаяСтрока Из ОстатокКнигНаСкладе Цикл
		Если ТекущаяСтрока.Выбрать Тогда
			Выбор.Добавить(ТекущаяСтрока);
		КонецЕсли;
					
	КонецЦикла;
	
	ОповеститьОВыборе(Выбор);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСписокДоступныхКниг()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНомеклатурыОстатки.Книга,
		|	ОстаткиНомеклатурыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиНомеклатуры.Остатки КАК ОстаткиНомеклатурыОстатки
		|ГДЕ
		|	ОстаткиНомеклатурыОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ОстатокКнигНаСкладе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
		
КонецПроцедуры
#КонецОбласти
