#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
	КонецЕсли;
	ОбновитьСписокДоступныхКниг();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Выбор = Новый Массив;

	Для Каждого ТекущаяСтрока Из ОстатокКнигНаСкладе Цикл
		Если ТекущаяСтрока.Выбрать Тогда
			Выбор.Добавить(ТекущаяСтрока);
		КонецЕсли;

	КонецЦикла;

	ОповеститьОВыборе(Выбор);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСписокДоступныхКниг()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНомеклатурыОстатки.Книга КАК Книга,
	|	ОстаткиНомеклатурыОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ Вт_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНомеклатурыОстатки
	|ГДЕ
	|	ОстаткиНомеклатурыОстатки.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистСрезПоследних.Книга КАК Книга,
	|	ПрайсЛистСрезПоследних.Склад КАК Склад,
	|	ПрайсЛистСрезПоследних.РозничнаяЦена КАК РозничнаяЦена
	|ПОМЕСТИТЬ ВТ_РозничныеЦены
	|ИЗ
	|	РегистрСведений.ПрайсЛист.СрезПоследних() КАК ПрайсЛистСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Остатки.Книга КАК Книга,
	|	Вт_Остатки.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_РозничныеЦены.РозничнаяЦена, 0) КАК Цена
	|ИЗ
	|	Вт_Остатки КАК Вт_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РозничныеЦены КАК ВТ_РозничныеЦены
	|		ПО (ВТ_РозничныеЦены.Книга = Вт_Остатки.Книга)";

	Запрос.УстановитьПараметр("Склад", Склад);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ОстатокКнигНаСкладе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти