// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Ответственный);
		Объект.ТекущийКурс = 1;
		Объект.Валюта = Справочники.Валюты.РоссийскийРубль;
		
		ДоступноСредствДляОплаты = ОбщегоНазначенияСервер.ПолучитьОстатокСредст();
		
		Если ДоступноСредствДляОплаты = 0 Или ДоступноСредствДляОплаты = Неопределено Тогда
			Сообщить("Не достаточно средств");
		КонецЕсли;
		
		
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТекущийКурс = Неопределено Или
		Объект.ТекущийКурс = 0 Тогда
		Сообщить("Задайте курс валюты!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ТекущаяВалюта = Объект.Валюта;
	Объект.ТекущийКурс = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
	
	Если Объект.ТекущийКурс = Неопределено 
		Или Объект.ТекущийКурс = 0 Тогда
		
		Сообщить("Задайте курс валюты");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.Валюта);
		ОткрытьФорму("Справочник.Валюты.Форма.ФормаЭлемента_Управляемая", ПараметрыФормы);
		Возврат;
		
	КонецЕсли;
	
	Если Не Объект.СписокКниг.Количество() = 0 Тогда
	
		РасчитатьСумму();
	
	КонецЕсли;
	
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКнигаПриИзменении(Элемент)
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПоступившихКниг



#КонецОбласти
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	Количество = Элементы.СписокКниг.ТекущиеДанные.Количество;
	
	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
		Возврат;
	КонецЕсли;
	 
	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма") * Объект.ТекущийКурс;
	
КонецПроцедуры






#КонецОбласти
