#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();
		Объект.ТекущийКурс = 1;
		Объект.Валюта = Справочники.Валюты.РоссийскийРубль;		
	КонецЕсли;
	
	УстановитьДоступныйОстатокСредст();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрока Из ВыбранноеЗначение Цикл
		 
		НоваяСтрока = Объект.ДокументыПоступления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;	

	РасчитатьИтог();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ТекущаяВалюта = Объект.Валюта;
	СтруктураВалюты = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
		
	Если СтруктураВалюты = Неопределено 
		Или Объект.ТекущийКурс = 0 Тогда
		
		Сообщить("Задайте курс валюты");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.Валюта);
		ОткрытьФорму("Справочник.Валюты.Форма.ФормаЭлемента_Управляемая", ПараметрыФормы);
		
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийКурс = СтруктураВалюты.Курс;
	Объект.Кратность = СтруктураВалюты.Кратность;
	СуммаВВалюте = Объект.Сумма * Объект.ТекущийКурс / Объект.Кратность;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигКнигаПриИзменении(Элемент)
	
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПоступления

&НаКлиенте
Процедура ДокументыПоступленияДокументПриИзменении(Элемент)
	
	ДокументСсылка = Элементы.ДокументыПоступления.ТекущиеДанные.Документ;
	СуммаДокумента = ОбщегоНазначенияСервер.СуммаДокументаПоступления(ДокументСсылка);
	
	Если СуммаДокумента = Неопределено Тогда
	
		Сообщить("Не удалось получить сумму документа, проверьте документ!");
		Возврат;
	КонецЕсли;
	
	Элементы.ДокументыПоступления.ТекущиеДанные.Сумма = СуммаДокумента;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьДокументыПрихода(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Сообщить ("Выберите контрагента!");
		Возврат;
	КонецЕсли;
	
	Объект.ДокументыПоступления.Очистить();
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	
	ОткрытьФорму("Документ.ОплатаПоставщику.Форма.ФормаВыбораНеОплаченныхДокументовПоступления",
				ПараметрыФормы,,,,,ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДоступныйОстатокСредст()
	
	Если Объект.Дата = НачалоДня(Объект.Дата) Или Не Объект.Проведен Тогда
	
		Дата = ТекущаяДата();		
	Иначе
		
		Дата =Объект.Дата;	
	КонецЕсли;
	
	ДоступноСредствДляОплаты = ОбщегоНазначенияСервер.ПолучитьОстатокСредстМагазина(Дата, Объект.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияПриИзменении(Элемент)
	
	РасчитатьИтог();
	
КонецПроцедуры

Процедура РасчитатьИтог()

	Объект.Сумма = Объект.ДокументыПоступления.Итог("Сумма");
	СуммаВВалюте = Объект.Сумма * Объект.ТекущийКурс / Объект.Кратность;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьДоступныйОстатокСредст();
	
КонецПроцедуры

#КонецОбласти
