#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БронированиеТоваров.Записывать = Истина;
	Движения.БронированиеТоваров.Очистить();
	Движения.БронированиеТоваров.Записать();
	
	
	//1. Получить данные документа
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаКниг.Книга КАК Книга,
		|	СУММА(ПродажаКниг.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.ПродажаКниг.СписокКниг КАК ПродажаКниг
		|ГДЕ
		|	ПродажаКниг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаКниг.Книга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Книга КАК Книга,
		|	ВТ_ТоварыДокумента.Количество КАК Количество
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//2. Записать движения в регистр (списать остатки)

	// регистр ОстаткиНомеклатуры Расход
	Движения.ОстаткиНомеклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.ОстаткиНомеклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Книга = ТекСтрокаСписокКниг.Книга;
		Движение.Количество = ТекСтрокаСписокКниг.Количество;
	КонецЦикла;  
	
	Движения.ОстаткиНомеклатуры.Записать(); 
	
	//3. Прочитать остатки и проверить не ушли ли мы в минус
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНомеклатуры.Книга КАК НомеКниганклатура,
		|	-ОстаткиНомеклатуры.КоличествоОстаток КАК Дефицит,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОстаткиНомеклатуры.Книга) КАК НоменклатураПредставление
		|ИЗ
		|	РегистрНакопления.ОстаткиНомеклатуры.Остатки(
		|			&Период,
		|			(Склад, Книга) В
		|				(ВЫБРАТЬ
		|					&Склад,
		|					ВТ_ТоварыДокумента.Книга КАК Книга
		|				ИЗ
		|					ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента)) КАК ОстаткиНомеклатуры
		|ГДЕ
		|	ОстаткиНомеклатуры.КоличествоОстаток < 0";

//	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
//		Период = '00010101';
//	Иначе
		Период = Новый Граница(МоментВремени(), ВидГраницы.Включая);
//	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();

	//4. Сообщить об отрицательных остатках
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает остатка товара " + Выборка.НоменклатураПредставление + " в количестве " + Выборка.Дефицит + " шт";
			Сообщение.Сообщить();	
		КонецЦикла;
				
	КонецЕсли;

	// регистр Выручка 
	Движения.Выручка.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Магазин = Склад;
		Движение.Оператор = Оператор;
		Движение.Сумма = Сумма;
	КонецЦикла;
	Движения.Выручка.Записать(); 
	
	// регистр ДенежныеСредстваСети Приход
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Магазин = Склад;
	Движение.ДенежныеСредства = Сумма;
	Движения.ДенежныеСредстваСети.Записать(); 
	

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
