// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Приемщик);
    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки(); 
	
	Элементы.СписокКниг.ТекущиеДанные.РозничнаяЦена = ЦенаПоставщика * (1 + ПроцентНаценки / 100);
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	Количество = Элементы.СписокКниг.ТекущиеДанные.Количество;
	
	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
		Возврат;
	КонецЕсли;
	 
	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма");
	
КонецПроцедуры


#КонецОбласти
