#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик 	= ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад 		= ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();
		Объект.ТекущийКурс 	= 1;
		Объект.Валюта 		= Справочники.Валюты.РоссийскийРубль;
		Объект.Кратность 	= 1;

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ТекущаяВалюта = Объект.Валюта;
	СтруктураВалюты = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
	Если Не ЗначениеЗаполнено(СтруктураВалюты) Тогда

		Объект.ТекущийКурс 	= 0;
		Объект.Кратность 	= 0;
		Сообщить("Задайте курс валюты!");
		Возврат;
	КонецЕсли;
	Если Объект.ТекущийКурс = Неопределено Или Объект.ТекущийКурс = 0 Тогда

		Сообщить("Задайте курс валюты");
		Возврат;

	КонецЕсли;

	Объект.ТекущийКурс = СтруктураВалюты.Курс;
	Объект.Кратность = СтруктураВалюты.Кратность;
	Объект.СуммаВВалюте = Объект.Сумма;

	Если Не Объект.СписокКниг.Количество() = 0 Тогда

		РасчитатьСумму();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)

	РасчитатьСумму();

	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.Цена;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки();

КонецПроцедуры

&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)

	РасчитатьСумму();

КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)

	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;

	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПроверкаДублированияСтрок(ДанныеСтроки, Объект.СписокКниг, "НазваниеКниги");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()

	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;

	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);

	Объект.СуммаВВалюте		 = Объект.СписокКниг.Итог("Сумма");
	Если Не Объект.Кратность <= 0 Тогда

		Объект.Сумма		 = Объект.СуммаВВалюте * Объект.ТекущийКурс / Объект.Кратность;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти