// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Приемщик);
		Объект.ТекущийКурс = 1;
		Объект.Валюта = Справочники.Валюты.РоссийскийРубль;
		
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТекущийКурс = Неопределено Или
		Объект.ТекущийКурс = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Задайте курс валюты!";
		
	КонецЕсли;
	
	Если Объект.СписокКниг.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Список поступивших книг пустой";
	
	КонецЕсли;
	
	Если Сообщение.Текст <> "" Тогда
		
		Сообщение.Сообщить();
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ТекущаяВалюта = Объект.Валюта;
	Объект.ТекущийКурс = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
	
	Если Объект.ТекущийКурс = Неопределено 
		Или Объект.ТекущийКурс = 0 Тогда
		
		Сообщить("Задайте курс валюты");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.Валюта);
		ОткрытьФорму("Справочник.Валюты.Форма.ФормаЭлемента_Управляемая", ПараметрыФормы);
		Возврат;
		
	КонецЕсли;
	
	Если Не Объект.СписокКниг.Количество() = 0 Тогда
	
		РасчитатьСумму();
	
	КонецЕсли;
	
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки(); 
	
	Элементы.СписокКниг.ТекущиеДанные.РозничнаяЦена = ЦенаПоставщика * (1 + ПроцентНаценки / 100);
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)
	
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
	
	Для каждого ТекущаяСтрока Из Объект.СписокКниг Цикл
		
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НазваниеКниги", Элементы.СписокКниг.ТекущиеДанные.НазваниеКниги);
		СтрокиСКнигами = Объект.СписокКниг.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиСКнигами.Количество() > 1 Тогда
			
			Сообщить("Такая книга уже есть");
		
		КонецЕсли;
	        
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	Количество = Элементы.СписокКниг.ТекущиеДанные.Количество;
	
	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
		Возврат;
	КонецЕсли;
	 
	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.СуммаВВалюте = Объект.СписокКниг.Итог("Сумма");
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма") * Объект.ТекущийКурс;
	
КонецПроцедуры






#КонецОбласти
