// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Приемщик);
		Объект.ТекущийКурс = 1;
		Объект.Валюта = Справочники.Валюты.РоссийскийРубль;
		
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "";
	
	Если Объект.ТекущийКурс = Неопределено Или
		Объект.ТекущийКурс = 0 Тогда		
		
		Сообщение.Текст = "Задайте курс валюты!";
		
	КонецЕсли;
	
	Если Объект.СписокКниг.Количество() = 0 Тогда	
		
		Сообщение.Текст = "Список поступивших книг пустой";
	
	КонецЕсли;
	
	Если Сообщение.Текст <> "" Тогда
		
		Сообщение.Сообщить();
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ТекущаяВалюта = Объект.Валюта;
	Объект.ТекущийКурс = ОбщегоНазначенияСервер.ПолучениеТекущегоКурсаВалюты(ТекущаяВалюта);
	
	Если Объект.ТекущийКурс = Неопределено 
		Или Объект.ТекущийКурс = 0 Тогда
		
		Сообщить("Задайте курс валюты");
		Возврат;
		
	КонецЕсли;
	
	Если Не Объект.СписокКниг.Количество() = 0 Тогда
	
		РасчитатьСумму();
	
	КонецЕсли;	
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.Цена;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки(); 

КонецПроцедуры

&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)
	
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
	
	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПроверкаДублированияСтрок(ДанныеСтроки, Объект.СписокКниг, "НазваниеКниги");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	
//	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
//		Возврат;
//	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);
	 
//	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.СуммаВВалюте	 = Объект.СписокКниг.Итог("Сумма");
	Объект.Сумма		 = Объект.СуммаВВалюте * Объект.ТекущийКурс;
	
КонецПроцедуры

#КонецОбласти
