////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для Получения ссылок на сотрудника и ресторан текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на сотрудника текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на ресторан текущего пользователя;//  
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции

// Возврат ссылки пользователя и ресторана.
// 
// Параметры:
//  Имя Имя пользователя тип строка
// 
// Возвращаемое значение:
//  Структура - Возврат ссылки пользователя и ресторана:
// * Ресторан Ссылка
// * Сотрудник Ссылка
Функция ВозвратСсылкиНаСотрудника(Имя) Экспорт
	
		ТекПотльзовательСтруктура = Новый Структура("Сотрудник");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИмяПользователя = &ИмяПользователя";
		Запрос.УстановитьПараметр("ИмяПользователя",Имя);

		РезультатЗапроса = Запрос.Выполнить(); 
		РезультатЗапроса = РезультатЗапроса.Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			ТекПотльзовательСтруктура.Сотрудник = РезультатЗапроса.Ссылка;
		КонецЦикла;
					
		Возврат ТекПотльзовательСтруктура; 
		
КонецФункции

// Вернуть значение параметра сеанса текущий пользователь.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Вернуть значение параметра сеанса текущий пользователь
Функция ВернутьЗначениеПараметраСеансаТекущийПользователь () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

//Функция ВозвратСсылкиНаМагазин(СотрудникСсылка) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Сотрудники.Магазин
//		|ИЗ
//		|	Справочник.Сотрудники КАК Сотрудники
//		|ГДЕ
//		|	Сотрудники.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Возврат ВыборкаДетальныеЗаписи.Магазин;
//	КонецЦикла;
//	
//	Возврат Неопределено;
//	
//КонецФункции

Функция ПолучитьКоличествоПользователейСистемы() Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Пользователи.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

КонецФункции
#КонецОбласти



