#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		МенеджерПрайсЛист 	= РегистрыСведений.ПрайсЛист;
		НаборЗаписей 		= МенеджерПрайсЛист.СоздатьНаборЗаписей();
		Для каждого ТекущаяСтрока Из Книги Цикл
		
			НоваяЗапись 				= НаборЗаписей.Добавить();
			НоваяЗапись.Период 			= ТекущаяДата();
			НоваяЗапись.Книга 			= ТекущаяСтрока.Книга;
			НоваяЗапись.РозничнаяЦена 	= ТекущаяСтрока.РозничнаяЦена;
			НоваяЗапись.Ответственный 	= Ответственный;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
	КонецПроцедуры
	
	#КонецОбласти
#КонецЕсли
