#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	ДоступноСредст = ОбщегоНазначенияСервер.ПолучитьОстатокСредстМагазина(Дата, Склад);

	Сообщение = Новый СообщениеПользователю;

	Если ТекущийКурс = Неопределено Или ТекущийКурс = 0 Тогда

		Сообщение.Текст = "Задайте курс валюты!";
	КонецЕсли;

	Если Сумма > ДоступноСредст Тогда

		Сообщение.Текст = "Сумма оплаты превышает остаток средств!";
	КонецЕсли;
	
	// регистр Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент = Контрагент;
	Движение.Магазин = Склад;
	Движение.Долг = Сумма;

	// регистр ДенежныеСредстваСети
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Магазин = Склад;
	Движение.ДенежныеСредства = Сумма;

	// регистр ОплаченныеПоступления
	Движения.ОплаченныеПоступления.Записывать = Истина;
	Для Каждого ТекСтрокаДокументыПоступления Из ДокументыПоступления Цикл
		Движение = Движения.ОплаченныеПоступления.Добавить();
		Движение.Период = Дата;
		Движение.Поступление = ТекСтрокаДокументыПоступления.Документ;
		Движение.Сумма = ТекСтрокаДокументыПоступления.Сумма;
	КонецЦикла;

	Если Сообщение.Текст <> "" Тогда

		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли