// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//TODO сделать добавление списка выбранных
	//СтруктураВозврата = Новый Структура;
	//Структура.Вставить("Документ",);
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
