#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СозданиеНовогоИздательства(Наименование) Экспорт

	НовоеИздательство = Справочники.Издательство.СоздатьЭлемент();
	НовоеИздательство.Наименование = Наименование;
	НовоеИздательство.Записать();
	Возврат НовоеИздательство.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти