
&НаКлиенте
Процедура ПолучитьКурсы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗагрузки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите дату загрузки!";
		Сообщение.Поле = "Объект.ДатаЗагрузки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПолучитьКурсыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКурсыНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьКурсы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКурсы(Команда)
	ЗаписатьКурсыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКурсыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаписатьКурсы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры
