
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	
	
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.СкладОтправки = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКниги(Команда)
	
	Оп = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Склад", Объект.СкладОтправки);
	ОткрытьФорму("Документ.ПеремещениеКниг.Форма.ФормаВыбораДоступныхКниг",ПараметрыФормы,,,,,Оп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт 
	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Документ", ВыбранноеЗначение.Ссылка);
//	КоличествоСовпадений = Объект.ДокументыПоступления.НайтиСтроки(СтруктураПоиска);
//	
//	Если КоличествоСовпадений.Количество() <> 0 Тогда
//		
//		Сообщить("Такие данные уже вводились!");
//		Возврат;
//		
//	КонецЕсли;
//	
//	НоваяСтрока = Объект.ДокументыПоступления.Добавить();
//	НоваяСтрока.Документ = ВыбранноеЗначение.Ссылка;
//	НоваяСтрока.Сумма = ВыбранноеЗначение.Сумма;
//	РасчитатьИтог();
//	
КонецПроцедуры
#КонецОбласти

