
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.СкладОтправки = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКниги(Команда)
	
	Оп = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Склад", Объект.СкладОтправки);
	ОткрытьФорму("Документ.ПеремещениеКниг.Форма.ФормаВыбораДоступныхКниг",ПараметрыФормы,,,,,Оп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	Для каждого ТекущаяСтрока Из ВыбранноеЗначение Цикл 
		НоваяСтрока = Объект.СписокПеремещаемыхКниг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	
КонецПроцедуры
#КонецОбласти

