// @strict-types
#Область ОбработчикиСобытий

// Код процедур и функций

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда

		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрКоманды);
		ПоказатьВопрос(Оповещение,
					   "Документ не записан, бронирование доступно после записи документа,  записать?",
					   РежимДиалогаВопрос.ДаНет,
					   0,
					   КодВозвратаДиалога.Да,
					   "Записать документ?");

	Иначе
		ВызватьВыполнениеБронированияНаСервере(ПараметрКоманды);

	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВызватьВыполнениеБронированияНаСервере(СсылкаНаДокумент)

	Документы.ПродажаКниг.ВыполнитьБронирование(СсылкаНаДокумент);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда

		ВызватьВыполнениеБронированияНаСервере(Параметры);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти