// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Оператор = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийМагазин();

	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигКнигаПриИзменении(Элемент)
	
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
	
	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);
	РасчетСуммыТЧ();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);
	РасчетСуммыТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигЦенаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.СписокКниг.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);
	РасчетСуммыТЧ();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасчетСуммыТЧ();
	
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма");
	
КонецПроцедуры


#КонецОбласти
