//TODO Картинки храняться в базе, лучше хранить на диске, что бы не раздувать базу. Либо добавить проверку что бы 
//картинки нельзы было загружать больше определенного размера. 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекстОписания = ТекущийОбъект.Описание.Получить();
	АдресКартинки = ПолучитьНавигационнуюСсылку(ТекущийОбъект, "Картинка");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда

		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресКартинки);
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));

	ИначеЕсли ПустаяСтрока(АдресКартинки) = Истина Тогда

		ТекущийОбъект.Картинка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеКниги = ТекстОписания.ПолучитьТекст();
	
	ТекущийОбъект.Описание = Новый ХранилищеЗначения(ТекстОписания);
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресКартинки);
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));
	ИначеЕсли ПустаяСтрока(АдресКартинки) = Истина Тогда
		
		ТекущийОбъект.Картинка = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовернутьКартинкуПротивЧасовой(Команда)
	
	ПовернутьФотоНаСервереПротивЧасовой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовернутьКартинку(Команда)
	
	ПовернутьКартинкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(Команда)
	
	АдресКартинки = "";

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите изображение";
	ПараметрыДиалога.Фильтр = "Изображение | *.jpg; *.png;*.bmp;*.jpeg";
	
	ЧтоДелатьПослеВыбораФайла = Новый ОписаниеОповещения("ПослеВыбораКартинки", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЧтоДелатьПослеВыбораФайла,,,,ПараметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораКартинки(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		
		Возврат;	
	КонецЕсли; 
	
	АдресКартинки = ОписаниеПомещенногоФайла.Адрес;

КонецПроцедуры 

&НаСервере
Процедура ПовернутьФотоНаСервереПротивЧасовой()
	
	Ссылка = ПолучитьИзВременногоХранилища(АдресКартинки);
	Картинка = новый Картинка(Ссылка);
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	ОбрабатываемаяКартинка.Повернуть(-90);
	АдресКартинки = ПоместитьВоВременноеХранилище(
	ОбрабатываемаяКартинка.ПолучитьКартинку().ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПовернутьКартинкуНаСервере()
	
	Ссылка = ПолучитьИзВременногоХранилища(АдресКартинки);
	Картинка = новый Картинка(Ссылка);
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	ОбрабатываемаяКартинка.Повернуть(90);
	АдресКартинки = ПоместитьВоВременноеХранилище(
	ОбрабатываемаяКартинка.ПолучитьКартинку().ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
