#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИмпортКниг(Команда)
	
	ОповещениеОбновления = Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ИмпортСпискаКниг.Форма",,,,,, 
		ОповещениеОбновления, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
