#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СозданиеНовогоАвтора(Наименование) Экспорт

	НовыйАвтор = Справочники.Авторы.СоздатьЭлемент();
	НовыйАвтор.Наименование = Наименование;
	НовыйАвтор.Записать();
	Возврат НовыйАвтор.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти