#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Книга КАК Книга,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ОстаткиНоменклатурыОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОстаткиНоменклатурыОстатки.СуммаОстаток / ОстаткиНоменклатурыОстатки.КоличествоОстаток
		|	КОНЕЦ КАК СредняяЦенв
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНоменклатурыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрайсЛистСрезПоследних.Книга КАК Книга,
		|	ПрайсЛистСрезПоследних.РозничнаяЦена КАК РозничнаяЦена
		|ПОМЕСТИТЬ ВТ_Прайс
		|ИЗ
		|	РегистрСведений.ПрайсЛист.СрезПоследних КАК ПрайсЛистСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Книга КАК Книга,
		|	ВТ_Остатки.КоличествоОстаток КАК КоличествоНаСкладах,
		|	ВТ_Остатки.СредняяЦенв КАК СредняяЦенаПартий,
		|	ВТ_Прайс.РозничнаяЦена КАК ТекущаяРозничнаяЦена,
		|	ВЫБОР
		|		КОГДА НаценкаВПроцентах.Значение = 0
		|			ТОГДА ВТ_Остатки.СредняяЦенв
		|		ИНАЧЕ ВТ_Остатки.СредняяЦенв * НаценкаВПроцентах.Значение / 100 + ВТ_Остатки.СредняяЦенв
		|	КОНЕЦ КАК РозничнаяЦена
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Прайс КАК ВТ_Прайс
		|		ПО ВТ_Остатки.Книга = ВТ_Прайс.Книга,
		|	Константа.НаценкаВПроцентах КАК НаценкаВПроцентах";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Объект.Книги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		Объект.Ответственный = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
