// @strict-types


#Область ПрограммныйИнтерфейс

Процедура РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки) Экспорт
	
	ДанныеСтроки.Сумма = ДанныеСтроки.Количество * ДанныеСтроки.Цена;
	
КонецПроцедуры

Процедура ПроверкаДублированияСтрок(ДанныеСтроки, ТабличнаяЧасть, НазваниеКолонки) Экспорт
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить(НазваниеКолонки, ДанныеСтроки[НазваниеКолонки]);
		КоличествоСовпадений = ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);
		
		Если КоличествоСовпадений.Количество() > 1 Тогда
			
			Сообщить("Такие данные уже вводились!");
			Возврат;
			
		КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
