#Область ПрограммныйИнтерфейс

// Процедура - Рассчитать суммы в строке табличной части
// 
// Параметры:
//  ДанныеСтроки -  - 
Процедура РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки) Экспорт

	ДанныеСтроки.Сумма = ДанныеСтроки.Количество * ДанныеСтроки.Цена;

КонецПроцедуры

// Процедура - Проверка дублирования строк
// 
// Параметры:
//  ДанныеСтроки -  - 
//  ТабличнаяЧасть -  - 
//  НазваниеКолонки -  - 
Процедура ПроверкаДублированияСтрок(ДанныеСтроки, ТабличнаяЧасть, НазваниеКолонки) Экспорт

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить(НазваниеКолонки, ДанныеСтроки[НазваниеКолонки]);
	КоличествоСовпадений = ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);

	Если КоличествоСовпадений.Количество() > 1 Тогда

		Сообщить("Такие данные уже вводились!");
		Возврат;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти