#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "";

	Если ТекущийКурс = Неопределено Или ТекущийКурс = 0 Тогда

		Сообщение.Текст = "Задайте курс валюты!";
	КонецЕсли;

	Если СписокКниг.Количество() = 0 Тогда

		Сообщение.Текст = "Список поступивших книг пустой";
	КонецЕсли;
	
	
	
	// регистр УчетПоступления Приход
	Движения.УчетПоступления.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл

		Движение = Движения.УчетПоступления.Добавить();
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаСписокКниг.НазваниеКниги;
		Движение.Контрагент = Поставщик;
		Движение.Количество = ТекСтрокаСписокКниг.Количество;
		Движение.Цена = ТекСтрокаСписокКниг.Цена * ТекущийКурс;
		;
	КонецЦикла;

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл

		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Движение.Долг = Сумма;
		Движение.Магазин = Склад;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл

		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Книга = ТекСтрокаСписокКниг.НазваниеКниги;
		Движение.Количество = ТекСтрокаСписокКниг.Количество;
		Движение.Партия = Ссылка;
		Движение.Сумма = Сумма;
	КонецЦикла;

	// регистр УчетПоступления Приход	
	НаборЗаписей = РегистрыСведений.Партии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партия.Установить(Ссылка);

	Для Каждого СтрокаТаблицы Из СписокКниг Цикл

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Книга = СтрокаТаблицы.НазваниеКниги;
		НоваяЗапись.Контрагент = Поставщик;
		НоваяЗапись.Партия = Ссылка;
		НоваяЗапись.Количество = СтрокаТаблицы.Количество;
		НоваяЗапись.Цена = СтрокаТаблицы.Цена * ТекущийКурс;
	КонецЦикла;

	НаборЗаписей.Записать();

	Если Сообщение.Текст <> "" Тогда

		Сообщение.Сообщить();
		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли