
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПрайсЛист
	Движения.ПрайсЛист.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.ПрайсЛист.Добавить();
		Движение.Книга = ТекСтрокаСписокКниг.НазваниеКниги;
		Движение.ЗакупочнаяЦена = ТекСтрокаСписокКниг.ЦенаПоставщика;
		Движение.РозничнаяЦена = ТекСтрокаСписокКниг.РозничнаяЦена;
	КонецЦикла;

	// регистр УчетПоступления Приход
	Движения.УчетПоступления.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.УчетПоступления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаСписокКниг.НазваниеКниги;
		Движение.Контрагент = Поставщик;
		Движение.Количество = ТекСтрокаСписокКниг.Количество;
	КонецЦикла;

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Движение.Долг = Сумма;
	КонецЦикла;

	// регистр НаличиеКнигНаСкладах Приход
	Движения.НаличиеКнигНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.НаличиеКнигНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Книга = ТекСтрокаСписокКниг.НазваниеКниги;
		Движение.Количество = ТекСтрокаСписокКниг.Количество;
	КонецЦикла;

КонецПроцедуры
