#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СозданиеНовойКниги(СтруктураКниги) Экспорт		
			
	НоваяКнига = Справочники.Книги.СоздатьЭлемент();
	НоваяКнига.Наименование = СтруктураКниги.Наименование;
	НоваяКнига.Авторы = СтруктураКниги.АвторыСсылка;
	НоваяКнига.Описание = СтруктураКниги.Описание;
	НоваяКнига.КодISBN = СтруктураКниги.КодISBN;
	НоваяКнига.Жанр = СтруктураКниги.ЖанрыСсылка;
	НоваяКнига.Издательство = СтруктураКниги.ИздательствоСсылка;
	НоваяКнига.ГодВыпуска = СтруктураКниги.ГодВыпуска;
	НоваяКнига.Записать();

КонецПроцедуры

Процедура РедактированиеКниги(СтруктураКниги) Экспорт

	КнигаРедактируемая = СтруктураКниги.Ссылка.ПолучитьОбъект();
	КнигаРедактируемая.Наименование = СтруктураКниги.Наименование;
	КнигаРедактируемая.Авторы = СтруктураКниги.АвторыСсылка;
	КнигаРедактируемая.Описание = СтруктураКниги.Описание;	
	КнигаРедактируемая.Жанр = СтруктураКниги.ЖанрыСсылка;
	КнигаРедактируемая.Издательство = СтруктураКниги.ИздательствоСсылка;
	КнигаРедактируемая.ГодВыпуска = СтруктураКниги.ГодВыпуска;
	КнигаРедактируемая.Записать();  	       

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти