#Область СлужебныеПроцедурыИФункции

// Создание новой книги.
// 
// Параметры:
//  СтруктураКниги Структура книги
Процедура СозданиеНовойКниги(СтруктураКниги) Экспорт

	НоваяКнига 					= Справочники.Книги.СоздатьЭлемент();
	НоваяКнига.Наименование 	= СтруктураКниги.Наименование;
	НоваяКнига.Авторы 			= СтруктураКниги.АвторыСсылка;
	НоваяКнига.ОписаниеКниги 	= СтруктураКниги.Описание;
	ФорматированныйДокумент 	= Новый ФорматированныйДокумент();
	Массив 						= Новый Массив;
    Массив.Добавить(СтруктураКниги.Описание);
    ФорматированныйДокумент.Добавить(Массив[0]);
    НоваяКнига.Описание 		= Новый ХранилищеЗначения(ФорматированныйДокумент);
	НоваяКнига.КодISBN 			= СтруктураКниги.КодISBN;
	НоваяКнига.Жанр 			= СтруктураКниги.ЖанрыСсылка;
	НоваяКнига.Издательство 	= СтруктураКниги.ИздательствоСсылка;
	НоваяКнига.ГодВыпуска 		= СтруктураКниги.ГодВыпуска;
	НоваяКнига.Записать();

КонецПроцедуры

// Редактирование книги.
// 
// Параметры:
//  СтруктураКниги - 
// Структура книги
Процедура РедактированиеКниги(СтруктураКниги) Экспорт

	КнигаРедактируемая 					= СтруктураКниги.Ссылка.ПолучитьОбъект();
	КнигаРедактируемая.Наименование 	= СтруктураКниги.Наименование;
	КнигаРедактируемая.Авторы 			= СтруктураКниги.АвторыСсылка;
	КнигаРедактируемая.ОписаниеКниги 	= СтруктураКниги.Описание;
	ФорматированныйДокумент 			= Новый ФорматированныйДокумент();
	Массив 								= Новый Массив;
    Массив.Добавить(СтруктураКниги.Описание);
    ФорматированныйДокумент.Добавить(Массив[0]);
    КнигаРедактируемая.Описание 		= Новый ХранилищеЗначения(ФорматированныйДокумент);
	КнигаРедактируемая.Жанр 			= СтруктураКниги.ЖанрыСсылка;
	КнигаРедактируемая.Издательство 	= СтруктураКниги.ИздательствоСсылка;
	КнигаРедактируемая.ГодВыпуска 		= СтруктураКниги.ГодВыпуска;
	КнигаРедактируемая.Записать();
КонецПроцедуры

#КонецОбласти



